In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 
from sklearn.preprocessing import LabelEncoder

In [2]:
df=pd.read_csv("EasyVisa.csv")
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [5]:
df.isnull().sum()

case_id                  0
continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

In [27]:
continents = df['continent'].unique()
unit_OF_wage = df['unit_of_wage'].unique()
Region_of_employment=df['region_of_employment'].unique()
education_of_employee=df['education_of_employee'].unique()

print("total continents are", continents)
print("total unit of wage", unit_OF_wage)
print("total region of employment",Region_of_employment)
print("types of education_of_employee",education_of_employee)

total continents are ['Asia' 'Africa' 'North America' 'Europe' 'South America' 'Oceania']
total unit of wage ['Hour' 'Year' 'Week' 'Month']
total region of employment ['West' 'Northeast' 'South' 'Midwest' 'Island']
types of education_of_employee ['High School' "Master's" "Bachelor's" 'Doctorate']

In [10]:
le=LabelEncoder()
df['full_time_position']=le.fit_transform(df['full_time_position'])
df['case_status']=le.fit_transform(df['case_status'])
df['has_job_experience']=le.fit_transform(df['has_job_experience'])
df['requires_job_training']=le.fit_transform(df['requires_job_training'])
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,0,0,14513,2007,West,592.2029,Hour,1,1
1,EZYV02,Asia,Master's,1,0,2412,2002,Northeast,83425.6500,Year,1,0
2,EZYV03,Asia,Bachelor's,0,1,44444,2008,West,122996.8600,Year,1,1
3,EZYV04,Asia,Bachelor's,0,0,98,1897,West,83434.0300,Year,1,1
4,EZYV05,Africa,Master's,1,0,1082,2005,South,149907.3900,Year,1,0

In [21]:
df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience         int64
requires_job_training      int64
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position         int64
case_status                int64
dtype: object

In [25]:
df['unit_of_wage'].head()

0    Hour
1    Year
2    Year
3    Year
4    Year
Name: unit_of_wage, dtype: object